src/main/resources/xml/accommodationFulfillmentServicePort/retrieveAccommodationServicesDetails/retrieveAccommodationServicesDetails.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:retrieveAccommodationServicesDetails>
         <retrieveAccommodationServicesDetailsRequest>
            <!--Optional:-->
            <enterpriseFacilityId>?</enterpriseFacilityId>
            <!--Optional:-->
            <requestDate>?</requestDate>
         </retrieveAccommodationServicesDetailsRequest>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:retrieveAccommodationServicesDetails>
   </soapenv:Body>
</soapenv:Envelope>
